/* Метод isNaN спробує перетворити передане значення в число, тому робимо так само.

NaN не дорівнює жодному іншому значенню (навіть самому собі), 
тому неможна просто конвертувати вхідне значення в Number і перевіряти якось типу value === NaN, бо результат завжди буде false.
Тому, щоб не використовувати функцію isNaN(), я конвертую назад в строку і порівнюю вже із строкою "NaN". 
<-- я вже використувувала такий спосіб в дз 4
*/

var value = null; // робила через змінну

function baNaNa (value){
    if (String(Number(value)) == "NaN") 
        return true;
    else
        return false;
}

console.log(`Моя реалізація функції isNaN вертає ${baNaNa(value)} для значення ${value}`);
