/* Цікаво, що через prompt ми отримуємо string, незалежно від того, що ввів користувач.
Для подальшої обробки нам потрібно перетворити вхідний аргумент на число.

При конвертації тексту або текст+число до Number результат буде NaN. 
NaN не дорівнює жодному іншому значенню (навіть самому собі), тому неможна просто конвертувати вхідну строку в number і перевіряти якось типу age === NaN, бо результат завжди буде false.
Тому, щоб не використовувати функцію isNaN(), я конвертую назад в строку і порівнюю вже із строкою "NaN". 

Виділяємо декілька класів:
- виключення 11 - 19 - років
- всі інші числа, що окінчуються на 1 - рік
- всі інші числа, що окінчуються на 2, 3, 4 - роки
- всі інші числа, що окінчуються на 0, 5, 6, 7, 8, 9 - років

Якимось чином треба відокремити останню цифру числа, щоб віднести її до класу. 
Шукала як це зробити, але бути варіанти з відокремленням через length і т.п., а потім нагуглила, що можна використовувати залишок від ділення. 
*/

var age = prompt("Скільки вам років?", ""); // другий параметр цілеспрямовано пустий, щоб не треба було видаляти дефолтне значення

age = String (Number (age)); 

if (age == "NaN"){
    console.log("Введіть число, будь ласка :)")
}
else if (age < 0){
    console.log("Введіть позитивне число, будь ласка :)")
}
else {
    if (age >= 11 && age <=19){
        console.log(age + " років")
    }
    else if (age % 10 == 1){
        console.log(age + " рік")
    }
    else if ((age % 10 == 2) || (age % 10 == 3) || (age % 10 == 4)){
        console.log(age + " роки")
    }
    else if ((age % 10 == 0) || (age % 10 == 5) || (age % 10 == 6) || (age % 10 == 7) || (age % 10 == 8) || (age % 10 == 9)){
        console.log(age + " років")
    }
    else 
    console.log("не можемо порахувати :)")
}

